src/MOVED_XRoadFolkRaw/GetPeoplePublicInfo.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xro="http://x-road.eu/xsd/xroad.xsd" xmlns:iden="http://x-road.eu/xsd/identifiers" xmlns:x="http://x-road.eu/xsd/x-road.xsd" xmlns:prod="http://us-folk-v2.x-road.eu/producer">
   <soapenv:Header>
      <xro:service iden:objectType="SERVICE">
         <iden:xRoadInstance>FO</iden:xRoadInstance>
         <iden:memberClass>GOV</iden:memberClass>
         <iden:memberCode>405388</iden:memberCode>
         <!--Optional:-->
         <iden:subsystemCode>us-folk-v2</iden:subsystemCode>
         <iden:serviceCode>GetPeoplePublicInfo</iden:serviceCode>
         <!--Optional:-->
         <iden:serviceVersion>v1</iden:serviceVersion>
      </xro:service>
      <xro:client iden:objectType="SUBSYSTEM">
         <iden:xRoadInstance>FO</iden:xRoadInstance>
         <iden:memberClass>GOV</iden:memberClass>
         <iden:memberCode>345334</iden:memberCode>
         <!--Optional:-->
         <iden:subsystemCode>HN-Tardis</iden:subsystemCode>
      </xro:client>
      <xro:id>123</xro:id>
      <xro:protocolVersion>4.0</xro:protocolVersion>
      <x:service>us-folk-v2.GetPeoplePublicInfo.v1</x:service>
      <x:id>?</x:id>
      <x:userId>?</x:userId>
      <x:producer>us-folk-v2</x:producer>
      <x:consumer>345334</x:consumer>
   </soapenv:Header>
   <soapenv:Body>
      <prod:GetPeoplePublicInfo>
         <request>
            <requestBody>
               <!--Optional:-->
               <!--<Date>?</Date>-->
               <ListOfPersonPublicInfoCriteria>
                  <!--Zero or more repetitions:-->
                  <PersonPublicInfoCriteria>
                     <!--Optional:-->
                     <!--<Building>?</Building>-->
                     <!--Optional:-->
                     <!--<City>?</City>-->
                     <!--Optional:-->
                     <!--<DateOfBirth>?</DateOfBirth>-->
                     <!--Optional:-->
                     <!--<FirstName>?</FirstName>-->
                     <!--Optional:-->
                     <!--<Id>?</Id>-->
                     <!--Optional:-->
                     <!--<LastName>?</LastName>-->
                     <!--Optional:-->
                     <!--<PublicId>?</PublicId>-->
                     <!--Optional:-->
                     <SSN></SSN>
                     <!--Optional:-->
                     <!--<Street>?</Street>-->
                     <!--Optional:-->
                     <!--<ExternalId>?</ExternalId>-->
                  </PersonPublicInfoCriteria>
               </ListOfPersonPublicInfoCriteria>
            </requestBody>
            <requestHeader>
               <token></token>
            </requestHeader>
         </request>
      </prod:GetPeoplePublicInfo>
   </soapenv:Body>
</soapenv:Envelope>